Тестовая_база_ERP_14/src/InformationRegisters/КэшВспомогательныхДанныхВидаБюджета/КэшВспомогательныхДанныхВидаБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КэшВспомогательныхДанныхВидаБюджета</name>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>CatalogRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКэша</name>
    <type>
      <types>EnumRef.ВидыКэшаБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РежимФормирования</name>
    <type>
      <types>EnumRef.РежимыФормированияБюджетныхОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ВидыКэшаБюджета/ВидыКэшаБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКэшаБюджета</name>
  <enumValues>
    <name>СтруктураКолонок</name>
  </enumValues>
  <enumValues>
    <name>СтруктураОписанияВидаБюджета</name>
  </enumValues>
  <enumValues>
    <name>ДеревоЭлементовБезДопЭлементов</name>
  </enumValues>
  <enumValues>
    <name>ДеревоЭлементовСДопЭлементами</name>
  </enumValues>
  <enumValues>
    <name>СхемыКомпоновки</name>
  </enumValues>
  <enumValues>
    <name>ДеревоВывода</name>
  </enumValues>
  <enumValues>
    <name>ПараметрыСпискаВвода</name>
  </enumValues>
  <enumValues>
    <name>РезультатПроверки</name>
  </enumValues>
  <enumValues>
    <name>ИспользуетГраницуФактическихДанных</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/КэшВспомогательныхДанныхВидаБюджета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Кэширует настройки вида бюджета путем записи в регистр сведений
// 
// Параметры:
//	ВидБюджета - СправочникСсылка.ВидыБюджетов - вид бюджета, настройки которого требуется записать в кэш
//	ВидКэша - ПеречислениеСсылка.ВидыКэшаБюджета - вид кэша бюджета
//	Значение - Булево, ХранилищеЗначения - для видов кэша РезультатПроверки и ИспользуетГраницуФактическихДанных принимает значение Булево
//	РежимФормирования (опционально) - ПеречислениеСсылка.РежимыФормированияБюджетныхОтчетов - режимы для бюджетных отчетов.
//
Процедура УстановитьЗначениеКэша(ВидБюджета, ВидКэша, Значение, РежимФормирования = Неопределено) Экспорт
	
	Запись = РегистрыСведений.КэшВспомогательныхДанныхВидаБюджета.СоздатьМенеджерЗаписи();
	
	Запись.ВидБюджета = ВидБюджета;
	Запись.ВидКэша = ВидКэша;
	Запись.РежимФормирования = РежимФормирования;
	
	Если ВидыКэшаТипБулево().Найти(ВидКэша) = Неопределено Тогда
		Запись.ЗначениеДвоичныеДанные = Новый ХранилищеЗначения(Значение);
	Иначе
		Запись.ЗначениеБулево = Значение;
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

// Возвращает сохраненные в кэше настройки
// 
// Параметры:
//	ВидБюджета - СправочникСсылка.ВидыБюджетов - вид бюджета, настройки которого требуется записать в кэш
//	ВидКэша - ПеречислениеСсылка.ВидыКэшаБюджета - вид кэша бюджета
//	РежимФормирования (опционально) - ПеречислениеСсылка.РежимыФормированияБюджетныхОтчетов - режимы для бюджетных отчетов.
//
// Возвращаемое значение:
//	Булево, ПроизвольноеЗначение - для видов кэша РезультатПроверки и ИспользуетГраницуФактическихДанных принимает значение Булево.
// 
Функция ПолучитьЗначениеКэша(ВидБюджета, ВидКэша, РежимФормирования = Неопределено) Экспорт
	
	Если ВидыКэшаТипБулево().Найти(ВидКэша) = Неопределено Тогда
		ИмяРеквизита = "ЗначениеДвоичныеДанные";
	Иначе
		ИмяРеквизита = "ЗначениеБулево";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КэшВспомогательныхДанныхВидаБюджета." + ИмяРеквизита + " КАК Значение
		|ИЗ
		|	РегистрСведений.КэшВспомогательныхДанныхВидаБюджета КАК КэшВспомогательныхДанныхВидаБюджета
		|ГДЕ
		|	КэшВспомогательныхДанныхВидаБюджета.ВидБюджета = &ВидБюджета
		|	И КэшВспомогательныхДанныхВидаБюджета.ВидКэша = &ВидКэша";
		
	Если РежимФормирования <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И КэшВспомогательныхДанныхВидаБюджета.РежимФормирования = &РежимФормирования";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
	Запрос.УстановитьПараметр("ВидКэша", ВидКэша);
	Запрос.УстановитьПараметр("РежимФормирования", РежимФормирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ИмяРеквизита = "ЗначениеБулево" Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	Иначе
		Возврат ВыборкаДетальныеЗаписи.Значение.Получить();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидыКэшаТипБулево()
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыКэшаБюджета.РезультатПроверки);
	Массив.Добавить(Перечисления.ВидыКэшаБюджета.ИспользуетГраницуФактическихДанных);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
